# 1.Завантажити та встановити Python (Не забуваємо про встановлення галочки "Add python to PATH")
# 2.Перевірити правильність установки і доступність python. Для цього в консолі (терміналі) вводимо команду: python -V (у відповідь повинні побачити Python 3.x.x - де х.х будуть цифри, що вказують на версію встановленого інтерпретатора)
# 3.Завантажити та встановити середовище розробки (IDE) PyCharm
# 4.Створити перший проект.
# 5.Додати до нього новий python файл
# 6.Набрати в цьому файлі першу програму: print('Hello World!')
# 7.Запустити програму на виконання
# 8.Переконатися, що програма виконалася без помилок
print ("BCEM /7PuBET")
print('BCE XOPOLLO')
