# Для списку цілих чисел потрібно знайти суму елементів із парними індексами [0-й, 2-й, 4-й ітд],
# потім перемножити цю суму на останній елемент вхідного масиву.
# Не забудьте, що перший елемент масиву має індекс 0.
# Для порожнього масиву результат завжди 0.
#
# дано:
# [1, 3, 5] => 30
# [6] => 36
# [] => 0

def sum_masive(lst):
    if not lst:
        return 0

    sum_parnie = sum(lst[i] for i in range(0, len(lst), 2))           # используем генератор для рассчета суммьі єллементов с парньіми индексами с шагом 2.
    return sum_parnie * lst[-1]                                       # возвращает сумму парньіх умноженую на последний єллемент списка

# Приклад використання:
input_list = [1, 3, 5]
# input_list = [6]
# input_list = []
# input_list = [6, 7, 4, 4, 3, 7]
result = sum_masive(input_list)
print(result)