# Ваша програма має перенести останній елемент списку з кінця на початок, тобто,
# останній елемент списку має стати першим.
# Послідовність інших елементів не має змінюватися.
# Порожній список або список з одним елементом повинен залишитися незмінним.
# Кількість елементів у списку може бути будь-яким – нуль та більше!
#




def zadom_na_pered(list):
    if len(list) <= 1:
        return list
    list[0], list[-1] = list[-1], list[0]
    return list

# My_list = [12, 3, 4, 10] #=> [10, 12, 3, 4]
# My_list = [1] # => [1]
# My_list = [] # => []
My_list = [12, 3, 4, 10, 8] # => [8, 12, 3, 4, 10]

result = zadom_na_pered(My_list)
print(result)