# На запит від програми, користувач вводить 5-ти значне ціле, позитивне число.
# Вам необхідно "перевернути" цє число задом наперед, тобто щоб у результаті вийшло теж 5-ти значне число,
# але із зворотною послідовністю цифр.
# Вам не потрібно перевіряти, що користувач ввів правильне число - зробіть вигляд,
# що користувач завжди вводить 5 значне число.
# Тобто введене користувачем число завжди складатиметься з 5 цифр.
# Якщо користувач ввів інше число, це проблема користувача, а не вашої програми.
# Використовуються лише цілі числа.
# Для розв'язання задачі потрібно використовувати лише той зріз даних, який було пройдено,
# тобто використовувати строки не можна.
# Приклади:
# Користувач ввів: 12345 - на екрані відображається: 54321
# Користувач ввів: 37568 - на екран відображається: 86573

you_number = int(input("BBEDuTE 5-и 3HA4HOE 4uCJIO: "))
n1 = you_number // 10000
n2 = you_number % 10000 // 1000
n3 = you_number // 100 % 10
n4 = you_number % 100 // 10
n5 = you_number % 100 // 1 % 10
print(n5, n4, n3, n2, n1)